#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
google_iam_workload_identity_pool.my-wif-pool: Refreshing state... [id=projects/workload-idenity-federation/locations/global/workloadIdentityPools/my-wif-pool]
google_project_iam_member.terraform_sa_role["roles/serviceusage.serviceUsageViewer"]: Refreshing state... [id=workload-idenity-federation/roles/serviceusage.serviceUsageViewer/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/storage.admin"]: Refreshing state... [id=workload-idenity-federation/roles/storage.admin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/iam.serviceAccountViewer"]: Refreshing state... [id=workload-idenity-federation/roles/iam.serviceAccountViewer/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/iam.workloadIdentityPoolAdmin"]: Refreshing state... [id=workload-idenity-federation/roles/iam.workloadIdentityPoolAdmin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_iam_member.terraform_sa_role["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=workload-idenity-federation/roles/resourcemanager.projectIamAdmin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com]
google_project_service.enable_api["sts.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/sts.googleapis.com]
google_project_service.enable_api["storage.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/storage.googleapis.com]
google_service_account_iam_member.terraform_sa: Refreshing state... [id=projects/workload-idenity-federation/serviceAccounts/terraform-github@workload-idenity-federation.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/524220704155/locations/global/workloadIdentityPools/my-wif-pool/attribute.repository/nevenisnoob/WorkloadIdentityFederation]
google_project_service.enable_api["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/cloudresourcemanager.googleapis.com]
google_project_service.enable_api["iam.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/iam.googleapis.com]
google_project_service.enable_api["iamcredentials.googleapis.com"]: Refreshing state... [id=workload-idenity-federation/iamcredentials.googleapis.com]
google_iam_workload_identity_pool_provider.my-wif-provider: Refreshing state... [id=projects/workload-idenity-federation/locations/global/workloadIdentityPools/my-wif-pool/providers/my-wif-provider]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_project_iam_member.terraform_sa_role["roles/iam.serviceAccountViewer"] will be destroyed
  # (because google_project_iam_member.terraform_sa_role is not in configuration)
  - resource "google_project_iam_member" "terraform_sa_role" {
      - etag    = "BwXzd1/3rI0=" -> null
      - id      = "workload-idenity-federation/roles/iam.serviceAccountViewer/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com" -> null
      - project = "workload-idenity-federation" -> null
      - role    = "roles/iam.serviceAccountViewer" -> null
    }

  # google_project_iam_member.terraform_sa_role["roles/iam.workloadIdentityPoolAdmin"] will be destroyed
  # (because google_project_iam_member.terraform_sa_role is not in configuration)
  - resource "google_project_iam_member" "terraform_sa_role" {
      - etag    = "BwXzd1/3rI0=" -> null
      - id      = "workload-idenity-federation/roles/iam.workloadIdentityPoolAdmin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com" -> null
      - project = "workload-idenity-federation" -> null
      - role    = "roles/iam.workloadIdentityPoolAdmin" -> null
    }

  # google_project_iam_member.terraform_sa_role["roles/resourcemanager.projectIamAdmin"] will be destroyed
  # (because google_project_iam_member.terraform_sa_role is not in configuration)
  - resource "google_project_iam_member" "terraform_sa_role" {
      - etag    = "BwXzd1/3rI0=" -> null
      - id      = "workload-idenity-federation/roles/resourcemanager.projectIamAdmin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com" -> null
      - project = "workload-idenity-federation" -> null
      - role    = "roles/resourcemanager.projectIamAdmin" -> null
    }

  # google_project_iam_member.terraform_sa_role["roles/serviceusage.serviceUsageViewer"] will be destroyed
  # (because google_project_iam_member.terraform_sa_role is not in configuration)
  - resource "google_project_iam_member" "terraform_sa_role" {
      - etag    = "BwXzd1/3rI0=" -> null
      - id      = "workload-idenity-federation/roles/serviceusage.serviceUsageViewer/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com" -> null
      - project = "workload-idenity-federation" -> null
      - role    = "roles/serviceusage.serviceUsageViewer" -> null
    }

  # google_project_iam_member.terraform_sa_role["roles/storage.admin"] will be destroyed
  # (because google_project_iam_member.terraform_sa_role is not in configuration)
  - resource "google_project_iam_member" "terraform_sa_role" {
      - etag    = "BwXzd1/3rI0=" -> null
      - id      = "workload-idenity-federation/roles/storage.admin/serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-github@workload-idenity-federation.iam.gserviceaccount.com" -> null
      - project = "workload-idenity-federation" -> null
      - role    = "roles/storage.admin" -> null
    }

  # google_service_account.terraform-sa will be created
  + resource "google_service_account" "terraform-sa" {
      + account_id   = "terraform-github"
      + description  = "A Terraform Service Account for GitHub Actions"
      + disabled     = false
      + display_name = "Terraform SA for GitHub Actions"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "workload-idenity-federation"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.terraform-sa will be created
  + resource "google_service_account_iam_member" "terraform-sa" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "principalSet://iam.googleapis.com/projects/524220704155/locations/global/workloadIdentityPools/my-wif-pool/attribute.repository/nevenisnoob/WorkloadIdentityFederation"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.terraform_sa will be destroyed
  # (because google_service_account_iam_member.terraform_sa is not in configuration)
  - resource "google_service_account_iam_member" "terraform_sa" {
      - etag               = "BwXzdmShpyg=" -> null
      - id                 = "projects/workload-idenity-federation/serviceAccounts/terraform-github@workload-idenity-federation.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/524220704155/locations/global/workloadIdentityPools/my-wif-pool/attribute.repository/nevenisnoob/WorkloadIdentityFederation" -> null
      - member             = "principalSet://iam.googleapis.com/projects/524220704155/locations/global/workloadIdentityPools/my-wif-pool/attribute.repository/nevenisnoob/WorkloadIdentityFederation" -> null
      - role               = "roles/iam.workloadIdentityUser" -> null
      - service_account_id = "projects/workload-idenity-federation/serviceAccounts/terraform-github@workload-idenity-federation.iam.gserviceaccount.com" -> null
    }

Plan: 2 to add, 0 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @nevenisnoob, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*